app/views/spots/index.html.erb

      <tr>
        <td><%= District.find(spot.district_id).name %></td>
---
SELECT  "districts".* FROM "districts" WHERE "districts"."id" = ? LIMIT 1  [["id", 1]]