app/controllers/adicional_services_controller.rb

  def index
    @adicional_services = AdicionalService.all
---
SELECT "adicional_services".* FROM "adicional_services"

  def create
    adicional_service = AdicionalService.new(params_adicional_service)
    adicional_service.save
---
INSERT INTO "adicional_services" ("name", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Lavado"], ["cost", 10.0], ["created_at", "2016-05-23 03:54:38.702213"], ["updated_at", "2016-05-23 03:54:38.702213"]]