app/controllers/cars_controller.rb

INSERT INTO "cars" ("plate", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["plate", "123456957"], ["user_id", 2], ["created_at", "2016-05-23 04:52:05.854928"], ["updated_at", "2016-05-23 04:52:05.854928"]]
---
  def create
    @car = Car.new(car_params)
    @car.user_id = current_user.id

    respond_to do |format|
      if @car.save