app/controllers/districts_controller.rb

SELECT "districts".* FROM "districts"
---
  def index
    @districts = District.all

INSERT INTO "districts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Santiago de Surco"], ["created_at", "2016-05-23 04:01:57.419053"], ["updated_at", "2016-05-23 04:01:57.419053"]]
---
  def create
    district = District.new(params_district)
    district.save