app/controllers/reservations_controller.rb

  def index
    @reservations = Reservation.where("user_id = ?",current_user.id)
---
SELECT "reservations".* FROM "reservations" WHERE (user_id = 2)

  def new
    @cars = Car.where("user_id = ?",current_user.id)
    @districts = District.all
---
SELECT "cars".* FROM "cars" WHERE (user_id = 2)
SELECT "districts".* FROM "districts"

  def create
    reservation = Reservation.new(params_reservation)
    reservation.user_id = current_user.id
    reservation.status = "waiting"
    fechadereserva = params[:fecha].to_date
    reservation.start_hour = Time.new(fechadereserva.year,fechadereserva.month,fechadereserva.day, params[:horainicio][0...2], params[:horainicio][3...5], 00)
    reservation.end_hour = Time.new(fechadereserva.year,fechadereserva.month,fechadereserva.day, params[:horafin][0...2], params[:horafin][3...5], 00)
    reservation.final_cost = (((reservation.end_hour-reservation.start_hour)/3600).round(2)*Spot.find(reservation.spot_id).cost).round(2)
    reservation.save
---
SELECT  "spots".* FROM "spots" WHERE "spots"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
INSERT INTO "reservations" ("car_id", "spot_id", "user_id", "status", "start_hour", "end_hour", "final_cost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def complete
    district = params[:district]
    @combo=Array.new
    @spots = Spot.where("district_id = ?",district)
---
SELECT "spots".* FROM "spots" WHERE (district_id = '1')