app/controllers/spots_controller.rb

  def index
    @spots = Spot.all
---
SELECT "spots".* FROM "spots"

  def new
    @spot = Spot.new
    @districts = District.all
---
SELECT "districts".* FROM "districts"

  def create
    spot = Spot.new(params_spot)
    spot.user_id = current_user.id
    spot.save
---
INSERT INTO "spots" ("district_id", "cost", "description", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["district_id", 1], ["cost", 5.0], ["description", "Es un lugar amplio"], ["address", "Encalada 509"], ["created_at", "2016-05-23 04:49:36.122574"], ["updated_at", "2016-05-23 04:49:36.122574"]]